bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
                if (garudaData.hwzc.goodZcCount >= ZC_SYNC_THRESHOLD)
                {
                    /* HW ZC had good lock — seed as synced to avoid
                     * pre-sync forced-commutation jerk at transition */
                    garudaData.timing.zcSynced = true;
                    garudaData.timing.goodZcCount = ZC_SYNC_THRESHOLD;
                    garudaData.timing.forcedCountdown =
                        swPeriod * ZC_TIMEOUT_MULT;
#if FEATURE_HW_OVERCURRENT
                    /* Lower CMP3 from startup to operational threshold */
                    HAL_CMP3_SetThreshold(OC_CMP3_DAC_VAL);
#endif
                }
                else
                {
                    /* HW ZC was struggling — conservative pre-sync */
                    garudaData.timing.zcSynced = false;
                    garudaData.timing.forcedCountdown = swPeriod;
                }
            }

            if (!garudaData.hwzc.enabled)
            {
#endif /* FEATURE_ADC_CMP_ZC */

            if (!garudaData.timing.zcSynced)
            {
                /* === PRE-SYNC: Forced commutation + passive ZC detection === */

                if (garudaData.timing.forcedCountdown > 0)
                    garudaData.timing.forcedCountdown--;

                if (garudaData.timing.forcedCountdown == 0)
                {
                    COMMUTATION_AdvanceStep(&garudaData);
                    BEMF_ZC_OnCommutation(&garudaData, adcIsrTick);

#if FEATURE_PRESYNC_RAMP
                    /* Feedback-gated pre-sync ramp: accelerate forced commutation
                     * only when ZC evidence is strong. Requires goodZcCount >= 3
                     * AND risingZcWorks — not a single noisy edge. If motor is
                     * stale (no recent ZC), hold current speed until motor catches
                     * up and ZC resumes. Same eRPM formula as OL_RAMP. */
                    if (garudaData.timing.stepPeriod > MIN_ADC_STEP_PERIOD
                        && garudaData.timing.goodZcCount >= 3
                        && garudaData.timing.risingZcWorks
                        && garudaData.timing.stepsSinceLastZc <= ZC_STALENESS_LIMIT)
                    {
                        uint32_t sp = garudaData.timing.stepPeriod;
                        uint32_t curErpm = ERPM_FROM_ADC_STEP_NUM / sp;
                        uint32_t deltaErpm = ((uint32_t)RAMP_ACCEL_ERPM_PER_S * sp)
                                             / PWMFREQUENCY_HZ;
                        if (deltaErpm < 1) deltaErpm = 1;
                        uint32_t newErpm = curErpm + deltaErpm;
                        uint32_t newPeriod = ERPM_FROM_ADC_STEP_NUM / newErpm;
                        if (newPeriod < MIN_ADC_STEP_PERIOD)
                            newPeriod = MIN_ADC_STEP_PERIOD;
                        garudaData.timing.stepPeriod = (uint16_t)newPeriod;
                    }
#endif

                    garudaData.timing.forcedCountdown = garudaData.timing.stepPeriod;
                    garudaData.zcDiag.forcedStepPresyncCount++;
                }

#if FEATURE_PRESYNC_RAMP
                /* Pre-sync timeout: fault if ZC never achieved */
                {
                    static uint32_t presyncEntryTick = 0;
                    if (prevAdcState != ESC_CLOSED_LOOP)
                        presyncEntryTick = garudaData.systemTick;

                    if ((garudaData.systemTick - presyncEntryTick) > PRESYNC_TIMEOUT_MS)
                    {
#if FEATURE_ADC_CMP_ZC
                        if (garudaData.hwzc.enabled)
                            HWZC_Disable(&garudaData);
                        garudaData.hwzc.fallbackPending = false;
#endif
#if FEATURE_HW_OVERCURRENT
                        HAL_CMP3_SetThreshold(OC_CMP3_STARTUP_DAC);
#endif
                        HAL_MC1PWMDisableOutputs();
                        garudaData.state = ESC_FAULT;
                        garudaData.faultCode = FAULT_STARTUP_TIMEOUT;
                        garudaData.runCommandActive = false;
                        LED2 = 0;
                    }
                }
#endif

                /* Passive ZC detection (builds goodZcCount, no commutation trigger) */
                BEMF_ZC_Poll(&garudaData, adcIsrTick);

                if (garudaData.timing.stepsSinceLastZc > ZC_STALENESS_LIMIT)
                    garudaData.timing.goodZcCount = 0;

                if (garudaData.timing.goodZcCount >= (uint16_t)ZC_SYNC_THRESHOLD
                    && garudaData.timing.risingZcWorks)
                {
                    garudaData.timing.zcSynced = true;
                    garudaData.desyncRestartAttempts = 0;
#if FEATURE_HW_OVERCURRENT
                    /* Lower CMP3 from startup to operational threshold */
                    HAL_CMP3_SetThreshold(OC_CMP3_DAC_VAL);
#endif
#if FEATURE_BEMF_INTEGRATION
                    garudaData.integ.bemfPeakSmooth = 0;
                    garudaData.integ.integral = 0;
                    garudaData.integ.stepDevMax = 0;
                    garudaData.integ.shadowFired = false;
#endif
                    if (garudaData.bemf.zeroCrossDetected)
                    {
#if FEATURE_TIMING_ADVANCE
                        uint16_t sp0 = garudaData.timing.stepPeriod;
                        uint32_t eRPM0 = ERPM_FROM_ADC_STEP_NUM / sp0;
                        uint16_t adv0;
                        if (eRPM0 <= RAMP_TARGET_ERPM)
                            adv0 = TIMING_ADVANCE_MIN_DEG;
                        else if (eRPM0 >= MAX_CLOSED_LOOP_ERPM)
                            adv0 = TIMING_ADVANCE_MAX_DEG;
                        else
                        {
                            uint32_t r0 = MAX_CLOSED_LOOP_ERPM - RAMP_TARGET_ERPM;
                            uint32_t p0 = eRPM0 - RAMP_TARGET_ERPM;
                            adv0 = TIMING_ADVANCE_MIN_DEG +
                                (uint16_t)((uint32_t)(TIMING_ADVANCE_MAX_DEG - TIMING_ADVANCE_MIN_DEG)
                                           * p0 / r0);
                        }
                        uint16_t d0 = (uint16_t)((uint32_t)sp0 * (30 - adv0) / 60);
                        garudaData.timing.commDeadline = (uint16_t)(adcIsrTick + d0);
#else
                        garudaData.timing.commDeadline = (uint16_t)(
                            adcIsrTick + garudaData.timing.stepPeriod / 2);
#endif
                        garudaData.timing.deadlineActive = true;
#if FEATURE_BEMF_INTEGRATION || FEATURE_ADC_CMP_ZC
                        garudaData.timing.deadlineIsZc = true;
#endif
                    }
                    else
                    {
                        BEMF_ZC_HandleUndetectableStep(&garudaData, adcIsrTick);
                    }
                }
            }
            else
            {
                /* === POST-SYNC: ZC-driven commutation === */

#if FEATURE_ADC_CMP_ZC
                /* Crossover check + enablePending management (Rule 12).
                 * dbgLatchDisable: after first HW ZC failure, permanently
                 * block re-enable so motor stays on SW ZC and diagnostics
                 * are preserved for debugger reading. */
                if (!garudaData.hwzc.dbgLatchDisable)
                {
                    uint32_t curErpm = ERPM_FROM_ADC_STEP_NUM /
                        garudaData.timing.stepPeriod;
                    if (curErpm >= HWZC_CROSSOVER_ERPM)
                        garudaData.hwzc.enablePending = true;
                    else if (garudaData.hwzc.enablePending
                             && curErpm < (HWZC_CROSSOVER_ERPM
                                           - HWZC_HYSTERESIS_ERPM))
                        garudaData.hwzc.enablePending = false;
                }
#endif

